import Foundation
import UIKit

struct SelectedCategoryRecepies {
    var image: UIImage?
    var labelOfRecepies: String
//    var tagOgCategory: String
//    var tagOfCountry: String
//    var addToFavorite: UIImage?
}

var selectedCategoryRecepies = [
    SelectedCategoryRecepies(image: UIImage(named: "selectedCategory"), labelOfRecepies: "Знаменитый красный борщ любят за особенный аромат, удивительный вкус и насыщенный цвет. Идеальное сочетание овощей придают красному борщу тот индивидуальный вкус, благодаря которому он входит в список самых известных супов мира. Борщ подают в дорогих ресторанах и готовят дома. Всякий раз, когда есть возможность попробовать борщ, мы выбираем именно его."),
    SelectedCategoryRecepies(image: UIImage(named: "selectedCategory"), labelOfRecepies: "Знаменитый красный борщ любят за особенный аромат, удивительный вкус и насыщенный цвет. Идеальное сочетание овощей придают красному борщу тот индивидуальный вкус, благодаря которому он входит в список самых известных супов мира. Борщ подают в дорогих ресторанах и готовят дома. Всякий раз, когда есть возможность попробовать борщ, мы выбираем именно его."),
    SelectedCategoryRecepies(image: UIImage(named: "selectedCategory"), labelOfRecepies: "Знаменитый красный борщ любят за особенный аромат, удивительный вкус и насыщенный цвет. Идеальное сочетание овощей придают красному борщу тот индивидуальный вкус, благодаря которому он входит в список самых известных супов мира. Борщ подают в дорогих ресторанах и готовят дома. Всякий раз, когда есть возможность попробовать борщ, мы выбираем именно его."),
    SelectedCategoryRecepies(image: UIImage(named: "selectedCategory"), labelOfRecepies: "Знаменитый красный борщ любят за особенный аромат, удивительный вкус и насыщенный цвет. Идеальное сочетание овощей придают красному борщу тот индивидуальный вкус, благодаря которому он входит в список самых известных супов мира. Борщ подают в дорогих ресторанах и готовят дома. Всякий раз, когда есть возможность попробовать борщ, мы выбираем именно его."),
    SelectedCategoryRecepies(image: UIImage(named: "selectedCategory"), labelOfRecepies: "Знаменитый красный борщ любят за особенный аромат, удивительный вкус и насыщенный цвет. Идеальное сочетание овощей придают красному борщу тот индивидуальный вкус, благодаря которому он входит в список самых известных супов мира. Борщ подают в дорогих ресторанах и готовят дома. Всякий раз, когда есть возможность попробовать борщ, мы выбираем именно его."),
    SelectedCategoryRecepies(image: UIImage(named: "selectedCategory"), labelOfRecepies: "Знаменитый красный борщ любят за особенный аромат, удивительный вкус и насыщенный цвет. Идеальное сочетание овощей придают красному борщу тот индивидуальный вкус, благодаря которому он входит в список самых известных супов мира. Борщ подают в дорогих ресторанах и готовят дома. Всякий раз, когда есть возможность попробовать борщ, мы выбираем именно его."),
]



