import Foundation

struct DescriptionOfRecepie {
//    var recepieImage: UIImage?
    var nameOfRecepie: String
    var categoryTagLabel: String
    var areaTagLabel: String
    var nameOfIngredient: String
    var amountOfIngredient: String
    var descriptionOfRecepie: String
}

var someRecepie = [
DescriptionOfRecepie(nameOfRecepie: "Какое-то название рецепта", categoryTagLabel: "Категория", areaTagLabel: "Откуда рецепт", nameOfIngredient: "Курица", amountOfIngredient: "200 грамм", descriptionOfRecepie: "Смешайте все сухие ингредиенты: муку просейте с неполной ч.л. разрыхлителя, добавьте мелкой соли, сахара, хорошо перемешайте./Блины с таким количеством сахара получатся умеренно сладкими, с интенсивным золотистым цветом. С меньшим количеством будут бледнее, с большим - быстро румянятся и даже могут пригорать/.Если кладёте соду, её также нужно смешать с мукой и предварительно не гасить - это сделает кефир прямо в тесте."),
DescriptionOfRecepie(nameOfRecepie: "Какое-то название рецепта", categoryTagLabel: "Категория", areaTagLabel: "Откуда рецепт", nameOfIngredient: "Курица", amountOfIngredient: "200 грамм", descriptionOfRecepie: "Смешайте все сухие ингредиенты: муку просейте с неполной ч.л. разрыхлителя, добавьте мелкой соли, сахара, хорошо перемешайте./Блины с таким количеством сахара получатся умеренно сладкими, с интенсивным золотистым цветом. С меньшим количеством будут бледнее, с большим - быстро румянятся и даже могут пригорать/.Если кладёте соду, её также нужно смешать с мукой и предварительно не гасить - это сделает кефир прямо в тесте."),
DescriptionOfRecepie(nameOfRecepie: "Какое-то название рецепта", categoryTagLabel: "Категория", areaTagLabel: "Откуда рецепт", nameOfIngredient: "Курица", amountOfIngredient: "200 грамм", descriptionOfRecepie: "Смешайте все сухие ингредиенты: муку просейте с неполной ч.л. разрыхлителя, добавьте мелкой соли, сахара, хорошо перемешайте./Блины с таким количеством сахара получатся умеренно сладкими, с интенсивным золотистым цветом. С меньшим количеством будут бледнее, с большим - быстро румянятся и даже могут пригорать/.Если кладёте соду, её также нужно смешать с мукой и предварительно не гасить - это сделает кефир прямо в тесте."),
DescriptionOfRecepie(nameOfRecepie: "Какое-то название рецепта", categoryTagLabel: "Категория", areaTagLabel: "Откуда рецепт", nameOfIngredient: "Курица", amountOfIngredient: "200 грамм", descriptionOfRecepie: "Смешайте все сухие ингредиенты: муку просейте с неполной ч.л. разрыхлителя, добавьте мелкой соли, сахара, хорошо перемешайте./Блины с таким количеством сахара получатся умеренно сладкими, с интенсивным золотистым цветом. С меньшим количеством будут бледнее, с большим - быстро румянятся и даже могут пригорать/.Если кладёте соду, её также нужно смешать с мукой и предварительно не гасить - это сделает кефир прямо в тесте."),
DescriptionOfRecepie(nameOfRecepie: "Какое-то название рецепта", categoryTagLabel: "Категория", areaTagLabel: "Откуда рецепт", nameOfIngredient: "Курица", amountOfIngredient: "200 грамм", descriptionOfRecepie: "Смешайте все сухие ингредиенты: муку просейте с неполной ч.л. разрыхлителя, добавьте мелкой соли, сахара, хорошо перемешайте./Блины с таким количеством сахара получатся умеренно сладкими, с интенсивным золотистым цветом. С меньшим количеством будут бледнее, с большим - быстро румянятся и даже могут пригорать/.Если кладёте соду, её также нужно смешать с мукой и предварительно не гасить - это сделает кефир прямо в тесте.")
]
